<a href="https://colab.research.google.com/github/Veebug/3-Par-Kenya/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2021_11_Victoria_Ondieki_DataReport.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [24]:
import pandas as pd
import numpy as np

In [2]:
geo_df=pd.read_csv("cells_geo.csv")
geo_df.head()

  ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0  0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1  1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2  2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3  3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4  4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...

In [37]:
cdr_descr_df=pd.read_excel("CDR_description.xlsx")
cdr_descr_df

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [4]:
geo_descr_df=pd.read_excel("cells_geo_description.xlsx")
geo_descr_df.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [31]:
#First we import the data
dataset1_df = pd.read_csv('Telcom_dataset1.csv')
dataset1_df.head()

#correcting the spelling
dataset1_df.columns.values[0:1]=['PRODUCT']
#Check for duplicates
dataset1_df.duplicated()
dataset1_df.drop_duplicates()

#we drop the columns we will not need
dataset1_df.dropna(axis = 1, how='all')
ds1_df=dataset1_df.drop(['COUNTRY_A','COUNTRY_B','SITE_ID','CELL_ON_SITE','DW_A_NUMBER_INT','CELL_ID','DW_B_NUMBER_INT'] , axis = 1)
ds1_df

     PRODUCT  VALUE               DATETIME
0      Voice      0  2012-05-06 23:04:37.0
1        sms      0  2012-05-06 23:05:25.0
2        sms     25  2012-05-06 23:05:41.0
3      Voice     56  2012-05-06 23:05:42.0
4      Voice     14  2012-05-06 23:06:29.0
...      ...    ...                    ...
4996     sms    100  2012-05-07 00:01:54.0
4997   Voice      1  2012-05-07 00:01:54.0
4998   Voice      0  2012-05-07 00:01:54.0
4999   Voice      0  2012-05-07 00:01:54.0
5000   Voice      7  2012-05-07 00:01:54.0

[5001 rows x 3 columns]

In [6]:
dataset1_df.describe()

             VALUE
count  5001.000000
mean     25.869626
std     101.934502
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    4440.000000

In [8]:
#grouping by voice and sms
dataset1_df.groupby(['PRODUTC']).mean()

             VALUE
PRODUTC
Voice    49.062190
data      8.713755
sms       6.821772

In [32]:
#First we import the data
dataset2_df = pd.read_csv('Telcom_dataset2.csv')
dataset2_df.head()

#correct spelling
dataset2_df.columns.values[0:1]=['PRODUCT']
#Check for duplicates
dataset2_df.duplicated()
dataset2_df.drop_duplicates()

#we drop the columns we will not need
dataset2_df.dropna(axis = 1, how='all')
ds2_df=dataset2_df.drop(['COUNTRY_A','COUNTRY_B','SITE_ID','CELL_ON_SITE','DW_A_NUMBER','CELL_ID','DW_B_NUMBER'] , axis = 1)
ds2_df

     PRODUCT  VALUE              DATE_TIME
0        sms      0  2012-05-07 23:02:06.0
1      Voice      0  2012-05-07 23:03:44.0
2        sms      0  2012-05-07 23:04:06.0
3      Voice     37  2012-05-07 23:04:48.0
4        sms     25  2012-05-07 23:04:58.0
...      ...    ...                    ...
4996     sms      0  2012-05-08 00:01:53.0
4997     sms     25  2012-05-08 00:01:53.0
4998     sms      0  2012-05-08 00:01:53.0
4999    data      0  2012-05-08 00:01:53.0
5000   Voice      0  2012-05-08 00:01:53.0

[5001 rows x 3 columns]

In [13]:
#grouping by voice and sms
dataset2_df.groupby(['PRODUCT']).mean()

             VALUE
PRODUCT
Voice    54.294858
data      7.180157
sms       5.458566

In [33]:
#First we import the data
dataset3_df = pd.read_csv('Telcom_dataset3.csv')
dataset3_df.head()

#correct spelling
dataset3_df.columns.values[0:1]=['PRODUCT']
#Check for duplicates
dataset3_df.duplicated()
dataset3_df.drop_duplicates()

#we drop the columns we will not need
dataset3_df.dropna(axis = 1, how='all')
ds3_df=dataset3_df.drop(['COUNTRY_A','COUNTRY_B','SIET_ID','CELL_ON_SITE','DW_A_NUMBER_INT','CELLID','DW_B_NUMBER_INT'] , axis = 1)
ds3_df

     PRODUCT  VALUE              DATE_TIME
0      Voice     61  2012-05-08 23:01:28.0
1        sms      0  2012-05-08 23:01:31.0
2      Voice     10  2012-05-08 23:02:59.0
3        sms      0  2012-05-08 23:03:04.0
4      Voice     22  2012-05-08 23:03:16.0
...      ...    ...                    ...
4996   Voice      0  2012-05-09 00:01:43.0
4997   Voice     62  2012-05-09 00:01:43.0
4998   Voice     32  2012-05-09 00:01:43.0
4999   Voice     30  2012-05-09 00:01:43.0
5000   Voice     60  2012-05-09 00:01:43.0

[5001 rows x 3 columns]

In [16]:
#grouping by voice and sms
dataset3_df.groupby(['PRODUCT']).mean()

             VALUE
PRODUCT
Voice    65.047372
data      6.861472
sms       9.844958

In [ ]:
#removing spelling errors to allow the columns to merge
dataset1_df.columns.values[0:1] = ["PRODUCT"]
dataset1_df.columns.values[2:3] = ["DATE_TIME"]

dataset2_df.columns.value[3:5] = ["DW_A_NUMBER_INT","DW_B_NUMBER_INT"]
dataset3_df.columns.value[5:] = ["CELL_ID","SITE_ID"]

In [34]:
#merging the data
ds=pd.concat([geo_df,cdr_descr_df,geo_descr_df,ds1_df,ds2_df,ds3_df],axis=1)
ds

     ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE  ...              DATE_TIME
0     0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:01:28.0
1     1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:01:31.0
2     2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:02:59.0
3     3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...                                                ...  2012-05-08 23:03:04.0
4     4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...                                                ...  2012-05-08 23:03:16.0
...                                                 ...                                                ...                    ...
4996                                                NaN                                                ...  2012-05-09 00:01:43.0
4997                                                NaN                                                ...  2012-05-09 00:01:43.0
4998                                                NaN                                                ...  2012-05-09 00:01:43.0
4999                                                NaN                                                ...  2012-05-09 00:01:43.0
5000                                                NaN                                                ...  2012-05-09 00:01:43.0

[5001 rows x 16 columns]

In [35]:
ds1=pd.concat([ds1_df,ds2_df,ds3_df],axis=1)
ds1

     PRODUCT VALUE  ... VALUE              DATE_TIME
0      Voice     0  ...    61  2012-05-08 23:01:28.0
1        sms     0  ...     0  2012-05-08 23:01:31.0
2        sms    25  ...    10  2012-05-08 23:02:59.0
3      Voice    56  ...     0  2012-05-08 23:03:04.0
4      Voice    14  ...    22  2012-05-08 23:03:16.0
...      ...   ...  ...   ...                    ...
4996     sms   100  ...     0  2012-05-09 00:01:43.0
4997   Voice     1  ...    62  2012-05-09 00:01:43.0
4998   Voice     0  ...    32  2012-05-09 00:01:43.0
4999   Voice     0  ...    30  2012-05-09 00:01:43.0
5000   Voice     7  ...    60  2012-05-09 00:01:43.0

[5001 rows x 9 columns]